Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1064daa176.h
  .extern USBE5TXA         /* 0xBF8E30A8 */
  .extern USBE5RXA         /* 0xBF8E30AC */
  .extern USBE6TXA         /* 0xBF8E30B0 */
  .extern USBE6RXA         /* 0xBF8E30B4 */
  .extern USBE7TXA         /* 0xBF8E30B8 */
  .extern USBE7RXA         /* 0xBF8E30BC */
  .extern USBE0CSR0        /* 0xBF8E3100 */
  .extern USBE0CSR2        /* 0xBF8E3108 */
  .extern USBE0CSR3        /* 0xBF8E310C */
  .extern USBE1CSR0        /* 0xBF8E3110 */
  .extern USBE1CSR1        /* 0xBF8E3114 */
  .extern USBE1CSR2        /* 0xBF8E3118 */
  .extern USBE1CSR3        /* 0xBF8E311C */
  .extern USBE2CSR0        /* 0xBF8E3120 */
  .extern USBE2CSR1        /* 0xBF8E3124 */
  .extern USBE2CSR2        /* 0xBF8E3128 */
  .extern USBE2CSR3        /* 0xBF8E312C */
  .extern USBE3CSR0        /* 0xBF8E3130 */
  .extern USBE3CSR1        /* 0xBF8E3134 */
  .extern USBE3CSR2        /* 0xBF8E3138 */
  .extern USBE3CSR3        /* 0xBF8E313C */
  .extern USBE4CSR0        /* 0xBF8E3140 */
  .extern USBE4CSR1        /* 0xBF8E3144 */
  .extern USBE4CSR2        /* 0xBF8E3148 */
  .extern USBE4CSR3        /* 0xBF8E314C */
  .extern USBE5CSR0        /* 0xBF8E3150 */
  .extern USBE5CSR1        /* 0xBF8E3154 */
  .extern USBE5CSR2        /* 0xBF8E3158 */
  .extern USBE5CSR3        /* 0xBF8E315C */
  .extern USBE6CSR0        /* 0xBF8E3160 */
  .extern USBE6CSR1        /* 0xBF8E3164 */
  .extern USBE6CSR2        /* 0xBF8E3168 */
  .extern USBE6CSR3        /* 0xBF8E316C */
  .extern USBE7CSR0        /* 0xBF8E3170 */
  .extern USBE7CSR1        /* 0xBF8E3174 */
  .extern USBE7CSR2        /* 0xBF8E3178 */
  .extern USBE7CSR3        /* 0xBF8E317C */
  .extern USBDMAINT        /* 0xBF8E3200 */
  .extern USBDMA1C         /* 0xBF8E3204 */
  .extern USBDMA1A         /* 0xBF8E3208 */
  .extern USBDMA1N         /* 0xBF8E320C */
  .extern USBDMA2C         /* 0xBF8E3214 */
  .extern USBDMA2A         /* 0xBF8E3218 */
  .extern USBDMA2N         /* 0xBF8E321C */
  .extern USBDMA3C         /* 0xBF8E3224 */
  .extern USBDMA3A         /* 0xBF8E3228 */
  .extern USBDMA3N         /* 0xBF8E322C */
  .extern USBDMA4C         /* 0xBF8E3234 */
  .extern USBDMA4A         /* 0xBF8E3238 */
  .extern USBDMA4N         /* 0xBF8E323C */
  .extern USBDMA5C         /* 0xBF8E3244 */
  .extern USBDMA5A         /* 0xBF8E3248 */
  .extern USBDMA5N         /* 0xBF8E324C */
  .extern USBDMA6C         /* 0xBF8E3254 */
  .extern USBDMA6A         /* 0xBF8E3258 */
  .extern USBDMA6N         /* 0xBF8E325C */
  .extern USBDMA7C         /* 0xBF8E3264 */
  .extern USBDMA7A         /* 0xBF8E3268 */
  .extern USBDMA7N         /* 0xBF8E326C */
  .extern USBDMA8C         /* 0xBF8E3274 */
  .extern USBDMA8A         /* 0xBF8E3278 */
  .extern USBDMA8N         /* 0xBF8E327C */
  .extern USBE1RPC         /* 0xBF8E3304 */
  .extern USBE2RPC         /* 0xBF8E3308 */
  .extern USBE3RPC         /* 0xBF8E330C */
  .extern USBE4RPC         /* 0xBF8E3310 */
  .extern USBE5RPC         /* 0xBF8E3314 */
  .extern USBE6RPC         /* 0xBF8E3318 */
  .extern USBE7RPC         /* 0xBF8E331C */
  .extern USBDPBFD         /* 0xBF8E3340 */
  .extern USBTMCON1        /* 0xBF8E3344 */
  .extern USBTMCON2        /* 0xBF8E3348 */
  .extern USBLPMR1         /* 0xBF8E3360 */
  .extern USBLMPR2         /* 0xBF8E3364 */
  .extern USBLPMP2         /* 0xBF8E3364 */
  .extern RNGVER           /* 0xBF8E6000 */
  .extern RNGCON           /* 0xBF8E6004 */
  .extern RNGPOLY1         /* 0xBF8E6008 */
  .extern RNGPOLY2         /* 0xBF8E600C */
  .extern RNGNUMGEN1       /* 0xBF8E6010 */
  .extern RNGNUMGEN2       /* 0xBF8E6014 */
  .extern RNGSEED1         /* 0xBF8E6018 */
  .extern RNGSEED2         /* 0xBF8E601C */
  .extern RNGCNT           /* 0xBF8E6020 */
  .extern GLCDMODE         /* 0xBF8EA000 */
  .extern GLCDCLKCON       /* 0xBF8EA004 */
  .extern GLCDBGCOLOR      /* 0xBF8EA008 */
  .extern GLCDRES          /* 0xBF8EA00C */
  .extern GLCDFPORCH       /* 0xBF8EA014 */
  .extern GLCDBLANKING     /* 0xBF8EA018 */
  .extern GLCDBPORCH       /* 0xBF8EA01C */
  .extern GLCDCURSOR       /* 0xBF8EA020 */
  .extern GLCDL0MODE       /* 0xBF8EA030 */
  .extern GLCDL0START      /* 0xBF8EA034 */
  .extern GLCDL0SIZE       /* 0xBF8EA038 */
  .extern GLCDL0BADDR      /* 0xBF8EA03C */
  .extern GLCDL0STRIDE     /* 0xBF8EA040 */
  .extern GLCDL0RES        /* 0xBF8EA044 */
  .extern GLCDL1MODE       /* 0xBF8EA050 */
  .extern GLCDL1START      /* 0xBF8EA054 */
  .extern GLCDL1SIZE       /* 0xBF8EA058 */
  .extern GLCDL1BADDR      /* 0xBF8EA05C */
  .extern GLCDL1STRIDE     /* 0xBF8EA060 */
  .extern GLCDL1RES        /* 0xBF8EA064 */
  .extern GLCDL2MODE       /* 0xBF8EA070 */
  .extern GLCDL2START      /* 0xBF8EA074 */
  .extern GLCDL2SIZE       /* 0xBF8EA078 */
  .extern GLCDL2BADDR      /* 0xBF8EA07C */
  .extern GLCDL2STRIDE     /* 0xBF8EA080 */
  .extern GLCDL2RES        /* 0xBF8EA084 */
  .extern GLCDINT          /* 0xBF8EA0F8 */
  .extern GLCDSTAT         /* 0xBF8EA0FC */
  .extern GLCDCLUT0        /* 0xBF8EA400 */
  .extern GLCDCLUT1        /* 0xBF8EA404 */
  .extern GLCDCLUT2        /* 0xBF8EA408 */
  .extern GLCDCLUT3        /* 0xBF8EA40C */
  .extern GLCDCLUT4        /* 0xBF8EA410 */
  .extern GLCDCLUT5        /* 0xBF8EA414 */
  .extern GLCDCLUT6        /* 0xBF8EA418 */
  .extern GLCDCLUT7        /* 0xBF8EA41C */
  .extern GLCDCLUT8        /* 0xBF8EA420 */
  .extern GLCDCLUT9        /* 0xBF8EA424 */
  .extern GLCDCLUT10       /* 0xBF8EA428 */
  .extern GLCDCLUT11       /* 0xBF8EA42C */
  .extern GLCDCLUT12       /* 0xBF8EA430 */
  .extern GLCDCLUT13       /* 0xBF8EA434 */
  .extern GLCDCLUT14       /* 0xBF8EA438 */
  .extern GLCDCLUT15       /* 0xBF8EA43C */
  .extern GLCDCLUT16       /* 0xBF8EA440 */
  .extern GLCDCLUT17       /* 0xBF8EA444 */
  .extern GLCDCLUT18       /* 0xBF8EA448 */
  .extern GLCDCLUT19       /* 0xBF8EA44C */
  .extern GLCDCLUT20       /* 0xBF8EA450 */
  .extern GLCDCLUT21       /* 0xBF8EA454 */
  .extern GLCDCLUT22       /* 0xBF8EA458 */
  .extern GLCDCLUT23       /* 0xBF8EA45C */
  .extern GLCDCLUT24       /* 0xBF8EA460 */
  .extern GLCDCLUT25       /* 0xBF8EA464 */
  .extern GLCDCLUT26       /* 0xBF8EA468 */
  .extern GLCDCLUT27       /* 0xBF8EA46C */
  .extern GLCDCLUT28       /* 0xBF8EA470 */
  .extern GLCDCLUT29       /* 0xBF8EA474 */
  .extern GLCDCLUT30       /* 0xBF8EA478 */
  .extern GLCDCLUT31       /* 0xBF8EA47C */
  .extern GLCDCLUT32       /* 0xBF8EA480 */
  .extern GLCDCLUT33       /* 0xBF8EA484 */
  .extern GLCDCLUT34       /* 0xBF8EA488 */
  .extern GLCDCLUT35       /* 0xBF8EA48C */
  .extern GLCDCLUT36       /* 0xBF8EA490 */
  .extern GLCDCLUT37       /* 0xBF8EA494 */
  .extern GLCDCLUT38       /* 0xBF8EA498 */
  .extern GLCDCLUT39       /* 0xBF8EA49C */
  .extern GLCDCLUT40       /* 0xBF8EA4A0 */
  .extern GLCDCLUT41       /* 0xBF8EA4A4 */
  .extern GLCDCLUT42       /* 0xBF8EA4A8 */
  .extern GLCDCLUT43       /* 0xBF8EA4AC */
  .extern GLCDCLUT44       /* 0xBF8EA4B0 */
  .extern GLCDCLUT45       /* 0xBF8EA4B4 */
  .extern GLCDCLUT46       /* 0xBF8EA4B8 */
  .extern GLCDCLUT47       /* 0xBF8EA4BC */
  .extern GLCDCLUT48       /* 0xBF8EA4C0 */
  .extern GLCDCLUT49       /* 0xBF8EA4C4 */
  .extern GLCDCLUT50       /* 0xBF8EA4C8 */
  .extern GLCDCLUT51       /* 0xBF8EA4CC */
  .extern GLCDCLUT52       /* 0xBF8EA4D0 */
  .extern GLCDCLUT53       /* 0xBF8EA4D4 */
  .extern GLCDCLUT54       /* 0xBF8EA4D8 */
  .extern GLCDCLUT55       /* 0xBF8EA4DC */
  .extern GLCDCLUT56       /* 0xBF8EA4E0 */
  .extern GLCDCLUT57       /* 0xBF8EA4E4 */
  .extern GLCDCLUT58       /* 0xBF8EA4E8 */
  .extern GLCDCLUT59       /* 0xBF8EA4EC */
  .extern GLCDCLUT60       /* 0xBF8EA4F0 */
  .extern GLCDCLUT61       /* 0xBF8EA4F4 */
  .extern GLCDCLUT62       /* 0xBF8EA4F8 */
  .extern GLCDCLUT63       /* 0xBF8EA4FC */
  .extern GLCDCLUT64       /* 0xBF8EA500 */
  .extern GLCDCLUT65       /* 0xBF8EA504 */
  .extern GLCDCLUT66       /* 0xBF8EA508 */
  .extern GLCDCLUT67       /* 0xBF8EA50C */
  .extern GLCDCLUT68       /* 0xBF8EA510 */
  .extern GLCDCLUT69       /* 0xBF8EA514 */
  .extern GLCDCLUT70       /* 0xBF8EA518 */
  .extern GLCDCLUT71       /* 0xBF8EA51C */
  .extern GLCDCLUT72       /* 0xBF8EA520 */
  .extern GLCDCLUT73       /* 0xBF8EA524 */
  .extern GLCDCLUT74       /* 0xBF8EA528 */
  .extern GLCDCLUT75       /* 0xBF8EA52C */
  .extern GLCDCLUT76       /* 0xBF8EA530 */
  .extern GLCDCLUT77       /* 0xBF8EA534 */
  .extern GLCDCLUT78       /* 0xBF8EA538 */
  .extern GLCDCLUT79       /* 0xBF8EA53C */
  .extern GLCDCLUT80       /* 0xBF8EA540 */
  .extern GLCDCLUT81       /* 0xBF8EA544 */
  .extern GLCDCLUT82       /* 0xBF8EA548 */
  .extern GLCDCLUT83       /* 0xBF8EA54C */
  .extern GLCDCLUT84       /* 0xBF8EA550 */
  .extern GLCDCLUT85       /* 0xBF8EA554 */
  .extern GLCDCLUT86       /* 0xBF8EA558 */
  .extern GLCDCLUT87       /* 0xBF8EA55C */
  .extern GLCDCLUT88       /* 0xBF8EA560 */
  .extern GLCDCLUT89       /* 0xBF8EA564 */
  .extern GLCDCLUT90       /* 0xBF8EA568 */
  .extern GLCDCLUT91       /* 0xBF8EA56C */
  .extern GLCDCLUT92       /* 0xBF8EA570 */
  .extern GLCDCLUT93       /* 0xBF8EA574 */
  .extern GLCDCLUT94       /* 0xBF8EA578 */
  .extern GLCDCLUT95       /* 0xBF8EA57C */
  .extern GLCDCLUT96       /* 0xBF8EA580 */
  .extern GLCDCLUT97       /* 0xBF8EA584 */
  .extern GLCDCLUT98       /* 0xBF8EA588 */
  .extern GLCDCLUT99       /* 0xBF8EA58C */
  .extern GLCDCLUT100      /* 0xBF8EA590 */
  .extern GLCDCLUT101      /* 0xBF8EA594 */
  .extern GLCDCLUT102      /* 0xBF8EA598 */
  .extern GLCDCLUT103      /* 0xBF8EA59C */
  .extern GLCDCLUT104      /* 0xBF8EA5A0 */
  .extern GLCDCLUT105      /* 0xBF8EA5A4 */
  .extern GLCDCLUT106      /* 0xBF8EA5A8 */
  .extern GLCDCLUT107      /* 0xBF8EA5AC */
  .extern GLCDCLUT108      /* 0xBF8EA5B0 */
  .extern GLCDCLUT109      /* 0xBF8EA5B4 */
  .extern GLCDCLUT110      /* 0xBF8EA5B8 */
  .extern GLCDCLUT111      /* 0xBF8EA5BC */
  .extern GLCDCLUT112      /* 0xBF8EA5C0 */
  .extern GLCDCLUT113      /* 0xBF8EA5C4 */
  .extern GLCDCLUT114      /* 0xBF8EA5C8 */
  .extern GLCDCLUT115      /* 0xBF8EA5CC */
  .extern GLCDCLUT116      /* 0xBF8EA5D0 */
  .extern GLCDCLUT117      /* 0xBF8EA5D4 */
  .extern GLCDCLUT118      /* 0xBF8EA5D8 */
  .extern GLCDCLUT119      /* 0xBF8EA5DC */
  .extern GLCDCLUT120      /* 0xBF8EA5E0 */
  .extern GLCDCLUT121      /* 0xBF8EA5E4 */
  .extern GLCDCLUT122      /* 0xBF8EA5E8 */
  .extern GLCDCLUT123      /* 0xBF8EA5EC */
  .extern GLCDCLUT124      /* 0xBF8EA5F0 */
  .extern GLCDCLUT125      /* 0xBF8EA5F4 */
  .extern GLCDCLUT126      /* 0xBF8EA5F8 */
  .extern GLCDCLUT127      /* 0xBF8EA5FC */
  .extern GLCDCLUT128      /* 0xBF8EA600 */
  .extern GLCDCLUT129      /* 0xBF8EA604 */
  .extern GLCDCLUT130      /* 0xBF8EA608 */
  .extern GLCDCLUT131      /* 0xBF8EA60C */
  .extern GLCDCLUT132      /* 0xBF8EA610 */
  .extern GLCDCLUT133      /* 0xBF8EA614 */
  .extern GLCDCLUT134      /* 0xBF8EA618 */
  .extern GLCDCLUT135      /* 0xBF8EA61C */
  .extern GLCDCLUT136      /* 0xBF8EA620 */
  .extern GLCDCLUT137      /* 0xBF8EA624 */
  .extern GLCDCLUT138      /* 0xBF8EA628 */
  .extern GLCDCLUT139      /* 0xBF8EA62C */
  .extern GLCDCLUT140      /* 0xBF8EA630 */
  .extern GLCDCLUT141      /* 0xBF8EA634 */
  .extern GLCDCLUT142      /* 0xBF8EA638 */
  .extern GLCDCLUT143      /* 0xBF8EA63C */
  .extern GLCDCLUT144      /* 0xBF8EA640 */
  .extern GLCDCLUT145      /* 0xBF8EA644 */
  .extern GLCDCLUT146      /* 0xBF8EA648 */
  .extern GLCDCLUT147      /* 0xBF8EA64C */
  .extern GLCDCLUT148      /* 0xBF8EA650 */
  .extern GLCDCLUT149      /* 0xBF8EA654 */
  .extern GLCDCLUT150      /* 0xBF8EA658 */
  .extern GLCDCLUT151      /* 0xBF8EA65C */
  .extern GLCDCLUT152      /* 0xBF8EA660 */
  .extern GLCDCLUT153      /* 0xBF8EA664 */
  .extern GLCDCLUT154      /* 0xBF8EA668 */
  .extern GLCDCLUT155      /* 0xBF8EA66C */
  .extern GLCDCLUT156      /* 0xBF8EA670 */
  .extern GLCDCLUT157      /* 0xBF8EA674 */
  .extern GLCDCLUT158      /* 0xBF8EA678 */
  .extern GLCDCLUT159      /* 0xBF8EA67C */
  .extern GLCDCLUT160      /* 0xBF8EA680 */
  .extern GLCDCLUT161      /* 0xBF8EA684 */
  .extern GLCDCLUT162      /* 0xBF8EA688 */
  .extern GLCDCLUT163      /* 0xBF8EA68C */
  .extern GLCDCLUT164      /* 0xBF8EA690 */
  .extern GLCDCLUT165      /* 0xBF8EA694 */
  .extern GLCDCLUT166      /* 0xBF8EA698 */
  .extern GLCDCLUT167      /* 0xBF8EA69C */
  .extern GLCDCLUT168      /* 0xBF8EA6A0 */
  .extern GLCDCLUT169      /* 0xBF8EA6A4 */
  .extern GLCDCLUT170      /* 0xBF8EA6A8 */
  .extern GLCDCLUT171      /* 0xBF8EA6AC */
  .extern GLCDCLUT172      /* 0xBF8EA6B0 */
  .extern GLCDCLUT173      /* 0xBF8EA6B4 */
  .extern GLCDCLUT174      /* 0xBF8EA6B8 */
  .extern GLCDCLUT175      /* 0xBF8EA6BC */
  .extern GLCDCLUT176      /* 0xBF8EA6C0 */
  .extern GLCDCLUT177      /* 0xBF8EA6C4 */
  .extern GLCDCLUT178      /* 0xBF8EA6C8 */
  .extern GLCDCLUT179      /* 0xBF8EA6CC */
  .extern GLCDCLUT180      /* 0xBF8EA6D0 */
  .extern GLCDCLUT181      /* 0xBF8EA6D4 */
  .extern GLCDCLUT182      /* 0xBF8EA6D8 */
  .extern GLCDCLUT183      /* 0xBF8EA6DC */
  .extern GLCDCLUT184      /* 0xBF8EA6E0 */
  .extern GLCDCLUT185      /* 0xBF8EA6E4 */
  .extern GLCDCLUT186      /* 0xBF8EA6E8 */
  .extern GLCDCLUT187      /* 0xBF8EA6EC */
  .extern GLCDCLUT188      /* 0xBF8EA6F0 */
  .extern GLCDCLUT189      /* 0xBF8EA6F4 */
  .extern GLCDCLUT190      /* 0xBF8EA6F8 */
  .extern GLCDCLUT191      /* 0xBF8EA6FC */
  .extern GLCDCLUT192      /* 0xBF8EA700 */
  .extern GLCDCLUT193      /* 0xBF8EA704 */
  .extern GLCDCLUT194      /* 0xBF8EA708 */
  .extern GLCDCLUT195      /* 0xBF8EA70C */
  .extern GLCDCLUT196      /* 0xBF8EA710 */
  .extern GLCDCLUT197      /* 0xBF8EA714 */
  .extern GLCDCLUT198      /* 0xBF8EA718 */
  .extern GLCDCLUT199      /* 0xBF8EA71C */
  .extern GLCDCLUT200      /* 0xBF8EA720 */
  .extern GLCDCLUT201      /* 0xBF8EA724 */
  .extern GLCDCLUT202      /* 0xBF8EA728 */
  .extern GLCDCLUT203      /* 0xBF8EA72C */
  .extern GLCDCLUT204      /* 0xBF8EA730 */
  .extern GLCDCLUT205      /* 0xBF8EA734 */
  .extern GLCDCLUT206      /* 0xBF8EA738 */
  .extern GLCDCLUT207      /* 0xBF8EA73C */
  .extern GLCDCLUT208      /* 0xBF8EA740 */
  .extern GLCDCLUT209      /* 0xBF8EA744 */
  .extern GLCDCLUT210      /* 0xBF8EA748 */
  .extern GLCDCLUT211      /* 0xBF8EA74C */
  .extern GLCDCLUT212      /* 0xBF8EA750 */
  .extern GLCDCLUT213      /* 0xBF8EA754 */
  .extern GLCDCLUT214      /* 0xBF8EA758 */
  .extern GLCDCLUT215      /* 0xBF8EA75C */
  .extern GLCDCLUT216      /* 0xBF8EA760 */
  .extern GLCDCLUT217      /* 0xBF8EA764 */
  .extern GLCDCLUT218      /* 0xBF8EA768 */
  .extern GLCDCLUT219      /* 0xBF8EA76C */
  .extern GLCDCLUT220      /* 0xBF8EA770 */
  .extern GLCDCLUT221      /* 0xBF8EA774 */
  .extern GLCDCLUT222      /* 0xBF8EA778 */
  .extern GLCDCLUT223      /* 0xBF8EA77C */
  .extern GLCDCLUT224      /* 0xBF8EA780 */
  .extern GLCDCLUT225      /* 0xBF8EA784 */
  .extern GLCDCLUT226      /* 0xBF8EA788 */
  .extern GLCDCLUT227      /* 0xBF8EA78C */
  .extern GLCDCLUT228      /* 0xBF8EA790 */
  .extern GLCDCLUT229      /* 0xBF8EA794 */
  .extern GLCDCLUT230      /* 0xBF8EA798 */
  .extern GLCDCLUT231      /* 0xBF8EA79C */
  .extern GLCDCLUT232      /* 0xBF8EA7A0 */
  .extern GLCDCLUT233      /* 0xBF8EA7A4 */
  .extern GLCDCLUT234      /* 0xBF8EA7A8 */
  .extern GLCDCLUT235      /* 0xBF8EA7AC */
  .extern GLCDCLUT236      /* 0xBF8EA7B0 */
  .extern GLCDCLUT237      /* 0xBF8EA7B4 */
  .extern GLCDCLUT238      /* 0xBF8EA7B8 */
  .extern GLCDCLUT239      /* 0xBF8EA7BC */
  .extern GLCDCLUT240      /* 0xBF8EA7C0 */
  .extern GLCDCLUT241      /* 0xBF8EA7C4 */
  .extern GLCDCLUT242      /* 0xBF8EA7C8 */
  .extern GLCDCLUT243      /* 0xBF8EA7CC */
  .extern GLCDCLUT244      /* 0xBF8EA7D0 */
  .extern GLCDCLUT245      /* 0xBF8EA7D4 */
  .extern GLCDCLUT246      /* 0xBF8EA7D8 */
  .extern GLCDCLUT247      /* 0xBF8EA7DC */
  .extern GLCDCLUT248      /* 0xBF8EA7E0 */
  .extern GLCDCLUT249      /* 0xBF8EA7E4 */
  .extern GLCDCLUT250      /* 0xBF8EA7E8 */
  .extern GLCDCLUT251      /* 0xBF8EA7EC */
  .extern GLCDCLUT252      /* 0xBF8EA7F0 */
  .extern GLCDCLUT253      /* 0xBF8EA7F4 */
  .extern GLCDCLUT254      /* 0xBF8EA7F8 */
  .extern GLCDCLUT255      /* 0xBF8EA7FC */
  .extern GLCDCURDATA0     /* 0xBF8EA800 */
  .extern GLCDCURDATA1     /* 0xBF8EA804 */
  .extern GLCDCURDATA2     /* 0xBF8EA808 */
  .extern GLCDCURDATA3     /* 0xBF8EA80C */
  .extern GLCDCURDATA4     /* 0xBF8EA810 */
  .extern GLCDCURDATA5     /* 0xBF8EA814 */
  .extern GLCDCURDATA6     /* 0xBF8EA818 */
  .extern GLCDCURDATA7     /* 0xBF8EA81C */
  .extern GLCDCURDATA8     /* 0xBF8EA820 */
  .extern GLCDCURDATA9     /* 0xBF8EA824 */
  .extern GLCDCURDATA10    /* 0xBF8EA828 */
  .extern GLCDCURDATA11    /* 0xBF8EA82C */
  .extern GLCDCURDATA12    /* 0xBF8EA830 */
  .extern GLCDCURDATA13    /* 0xBF8EA834 */
  .extern GLCDCURDATA14    /* 0xBF8EA838 */
  .extern GLCDCURDATA15    /* 0xBF8EA83C */
  .extern GLCDCURDATA16    /* 0xBF8EA840 */
  .extern GLCDCURDATA17    /* 0xBF8EA844 */
  .extern GLCDCURDATA18    /* 0xBF8EA848 */
  .extern GLCDCURDATA19    /* 0xBF8EA84C */
  .extern GLCDCURDATA20    /* 0xBF8EA850 */
  .extern GLCDCURDATA21    /* 0xBF8EA854 */
  .extern GLCDCURDATA22    /* 0xBF8EA858 */
  .extern GLCDCURDATA23    /* 0xBF8EA85C */
  .extern GLCDCURDATA24    /* 0xBF8EA860 */
  .extern GLCDCURDATA25    /* 0xBF8EA864 */
  .extern GLCDCURDATA26    /* 0xBF8EA868 */
  .extern GLCDCURDATA27    /* 0xBF8EA86C */
  .extern GLCDCURDATA28    /* 0xBF8EA870 */
  .extern GLCDCURDATA29    /* 0xBF8EA874 */
  .extern GLCDCURDATA30    /* 0xBF8EA878 */
  .extern GLCDCURDATA31    /* 0xBF8EA87C */
  .extern GLCDCURDATA32    /* 0xBF8EA880 */
  .extern GLCDCURDATA33    /* 0xBF8EA884 */
  .extern GLCDCURDATA34    /* 0xBF8EA888 */
  .extern GLCDCURDATA35    /* 0xBF8EA88C */
  .extern GLCDCURDATA36    /* 0xBF8EA890 */
  .extern GLCDCURDATA37    /* 0xBF8EA894 */
  .extern GLCDCURDATA38    /* 0xBF8EA898 */
  .extern GLCDCURDATA39    /* 0xBF8EA89C */
  .extern GLCDCURDATA40    /* 0xBF8EA8A0 */
  .extern GLCDCURDATA41    /* 0xBF8EA8A4 */
  .extern GLCDCURDATA42    /* 0xBF8EA8A8 */
  .extern GLCDCURDATA43    /* 0xBF8EA8AC */
  .extern GLCDCURDATA44    /* 0xBF8EA8B0 */
  .extern GLCDCURDATA45    /* 0xBF8EA8B4 */
  .extern GLCDCURDATA46    /* 0xBF8EA8B8 */
  .extern GLCDCURDATA47    /* 0xBF8EA8BC */
  .extern GLCDCURDATA48    /* 0xBF8EA8C0 */
  .extern GLCDCURDATA49    /* 0xBF8EA8C4 */
  .extern GLCDCURDATA50    /* 0xBF8EA8C8 */
  .extern GLCDCURDATA51    /* 0xBF8EA8CC */
  .extern GLCDCURDATA52    /* 0xBF8EA8D0 */
  .extern GLCDCURDATA53    /* 0xBF8EA8D4 */
  .extern GLCDCURDATA54    /* 0xBF8EA8D8 */
  .extern GLCDCURDATA55    /* 0xBF8EA8DC */
  .extern GLCDCURDATA56    /* 0xBF8EA8E0 */
  .extern GLCDCURDATA57    /* 0xBF8EA8E4 */
  .extern GLCDCURDATA58    /* 0xBF8EA8E8 */
  .extern GLCDCURDATA59    /* 0xBF8EA8EC */
  .extern GLCDCURDATA60    /* 0xBF8EA8F0 */
  .extern GLCDCURDATA61    /* 0xBF8EA8F4 */
  .extern GLCDCURDATA62    /* 0xBF8EA8F8 */
  .extern GLCDCURDATA63    /* 0xBF8EA8FC */
  .extern GLCDCURDATA64    /* 0xBF8EA900 */
  .extern GLCDCURDATA65    /* 0xBF8EA904 */
  .extern GLCDCURDATA66    /* 0xBF8EA908 */
  .extern GLCDCURDATA67    /* 0xBF8EA90C */
  .extern GLCDCURDATA68    /* 0xBF8EA910 */
  .extern GLCDCURDATA69    /* 0xBF8EA914 */
  .extern GLCDCURDATA70    /* 0xBF8EA918 */
  .extern GLCDCURDATA71    /* 0xBF8EA91C */
  .extern GLCDCURDATA72    /* 0xBF8EA920 */
  .extern GLCDCURDATA73    /* 0xBF8EA924 */
  .extern GLCDCURDATA74    /* 0xBF8EA928 */
  .extern GLCDCURDATA75    /* 0xBF8EA92C */
  .extern GLCDCURDATA76    /* 0xBF8EA930 */
  .extern GLCDCURDATA77    /* 0xBF8EA934 */
  .extern GLCDCURDATA78    /* 0xBF8EA938 */
  .extern GLCDCURDATA79    /* 0xBF8EA93C */
  .extern GLCDCURDATA80    /* 0xBF8EA940 */
  .extern GLCDCURDATA81    /* 0xBF8EA944 */
  .extern GLCDCURDATA82    /* 0xBF8EA948 */
  .extern GLCDCURDATA83    /* 0xBF8EA94C */
  .extern GLCDCURDATA84    /* 0xBF8EA950 */
  .extern GLCDCURDATA85    /* 0xBF8EA954 */
  .extern GLCDCURDATA86    /* 0xBF8EA958 */
  .extern GLCDCURDATA87    /* 0xBF8EA95C */
  .extern GLCDCURDATA88    /* 0xBF8EA960 */
  .extern GLCDCURDATA89    /* 0xBF8EA964 */
  .extern GLCDCURDATA90    /* 0xBF8EA968 */
  .extern GLCDCURDATA91    /* 0xBF8EA96C */
  .extern GLCDCURDATA92    /* 0xBF8EA970 */
  .extern GLCDCURDATA93    /* 0xBF8EA974 */
  .extern GLCDCURDATA94    /* 0xBF8EA978 */
  .extern GLCDCURDATA95    /* 0xBF8EA97C */
  .extern GLCDCURDATA96    /* 0xBF8EA980 */
  .extern GLCDCURDATA97    /* 0xBF8EA984 */
  .extern GLCDCURDATA98    /* 0xBF8EA988 */
  .extern GLCDCURDATA99    /* 0xBF8EA98C */
  .extern GLCDCURDATA100   /* 0xBF8EA990 */
  .extern GLCDCURDATA101   /* 0xBF8EA994 */
  .extern GLCDCURDATA102   /* 0xBF8EA998 */
  .extern GLCDCURDATA103   /* 0xBF8EA99C */
  .extern GLCDCURDATA104   /* 0xBF8EA9A0 */
  .extern GLCDCURDATA105   /* 0xBF8EA9A4 */
  .extern GLCDCURDATA106   /* 0xBF8EA9A8 */
  .extern GLCDCURDATA107   /* 0xBF8EA9AC */
  .extern GLCDCURDATA108   /* 0xBF8EA9B0 */
  .extern GLCDCURDATA109   /* 0xBF8EA9B4 */
  .extern GLCDCURDATA110   /* 0xBF8EA9B8 */
  .extern GLCDCURDATA111   /* 0xBF8EA9BC */
  .extern GLCDCURDATA112   /* 0xBF8EA9C0 */
  .extern GLCDCURDATA113   /* 0xBF8EA9C4 */
  .extern GLCDCURDATA114   /* 0xBF8EA9C8 */
  .extern GLCDCURDATA115   /* 0xBF8EA9CC */
  .extern GLCDCURDATA116   /* 0xBF8EA9D0 */
  .extern GLCDCURDATA117   /* 0xBF8EA9D4 */
  .extern GLCDCURDATA118   /* 0xBF8EA9D8 */
  .extern GLCDCURDATA119   /* 0xBF8EA9DC */
  .extern GLCDCURDATA120   /* 0xBF8EA9E0 */
  .extern GLCDCURDATA121   /* 0xBF8EA9E4 */
  .extern GLCDCURDATA122   /* 0xBF8EA9E8 */
  .extern GLCDCURDATA123   /* 0xBF8EA9EC */
  .extern GLCDCURDATA124   /* 0xBF8EA9F0 */
  .extern GLCDCURDATA125   /* 0xBF8EA9F4 */
  .extern GLCDCURDATA126   /* 0xBF8EA9F8 */
  .extern GLCDCURDATA127   /* 0xBF8EA9FC */
  .extern GLCDCURLUT0      /* 0xBF8EAA00 */
  .extern GLCDCURLUT1      /* 0xBF8EAA04 */
  .extern GLCDCURLUT2      /* 0xBF8EAA08 */
  .extern GLCDCURLUT3      /* 0xBF8EAA0C */
  .extern GLCDCURLUT4      /* 0xBF8EAA10 */
  .extern GLCDCURLUT5      /* 0xBF8EAA14 */
  .extern GLCDCURLUT6      /* 0xBF8EAA18 */
  .extern GLCDCURLUT7      /* 0xBF8EAA1C */
  .extern GLCDCURLUT8      /* 0xBF8EAA20 */
  .extern GLCDCURLUT9      /* 0xBF8EAA24 */
  .extern GLCDCURLUT10     /* 0xBF8EAA28 */
  .extern GLCDCURLUT11     /* 0xBF8EAA2C */
  .extern GLCDCURLUT12     /* 0xBF8EAA30 */
  .extern GLCDCURLUT13     /* 0xBF8EAA34 */
  .extern GLCDCURLUT14     /* 0xBF8EAA38 */
  .extern GLCDCURLUT15     /* 0xBF8EAA3C */
  .extern GPUBASEADDR      /* 0xBF8EB000 */
  .extern SDHCBLKCON       /* 0xBF8EC004 */
  .extern SDHCARG          /* 0xBF8EC008 */
  .extern SDHCMODE         /* 0xBF8EC00C */
  .extern SDHCRESP0        /* 0xBF8EC010 */
  .extern SDHCRESP1        /* 0xBF8EC014 */
  .extern SDHCRESP2        /* 0xBF8EC018 */
  .extern SDHCRESP3        /* 0xBF8EC01C */
  .extern SDHCDATA         /* 0xBF8EC020 */
  .extern SDHCSTAT1        /* 0xBF8EC024 */
  .extern SDHCCON1         /* 0xBF8EC028 */
  .extern SDHCCON2         /* 0xBF8EC02C */
  .extern SDHCINTSTAT      /* 0xBF8EC030 */
  .extern SDHCINTEN        /* 0xBF8EC034 */
  .extern SDHCINTSEN       /* 0xBF8EC038 */
  .extern SDHCSTAT2        /* 0xBF8EC03C */
  .extern SDHCCAP          /* 0xBF8EC040 */
  .extern SDHCMAXCAP       /* 0xBF8EC048 */
  .extern SDHCFE           /* 0xBF8EC050 */
  .extern SDHCAESTAT       /* 0xBF8EC054 */
  .extern SDHCAADDR        /* 0xBF8EC058 */
  .extern SBFLAG0          /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
